InformationRegisters/бит_БитфонНастройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>бит_БитфонНастройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПрофильНастроек</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ПрофилиНастроекБИТPhone</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресПрокси</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CallerID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Протоколы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалПеререгистрации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоопределениеNAT</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерФакса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДиректорияОтправкиФаксов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПользовательОтправкиФаксов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПарольОтправкиФаксов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДиректорияЗаписанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФорматЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ФорматЗаписи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаПереадресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьКомандаОтправкиФакса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлубинаИсторииЗвонков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрефиксВыходаНаВнешнююЛинию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПрямойНабор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьКомандуНеБеспокоитьНаАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомандаОтменаНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимНеБеспокоить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерверЛицензийНеИспользоватьПрокси</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытиеПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрыватьИзбранноеПриПереводеЗвонка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтоподнятиеПриВхЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытиеПриИсходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоздаватьСобытияПриВнутреннихЗвонках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтопереводНаМенеджера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерАвтопереводаНеизвестногоКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВсегдаЗаписыватьРазговор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправкаСМСЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправкаСМСПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправкаСМСОтправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтеграцияСБИТАТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстерискЛогин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветСтатусаСвободен</Name>
					<Comment>На форму не помещается</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветСтатусаОжидание</Name>
					<Comment>На форму не помещается</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветСтатусаНомерНеНайден</Name>
					<Comment>На форму не помещается</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветСтатусаРазговаривает</Name>
					<Comment>На форму не помещается</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦветСтатусаНеДоступен</Name>
					<Comment>На форму не помещается</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстерискПароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстерискДиректорияЗаписанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АстерискКонтекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньЛоггирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтационарныйТелефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСтационарныйТелефон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвтозапускПриСтартеСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазворачиватьОкноПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткрыватьКартуЯндексПриВходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТипПодключенияСтатусов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_УдалитьТипПодключенияСтатуса</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолучениеСтатусов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИскатьКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПриемаЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипПриемаЗвонка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПривязыватьФайлПриИсходящемЗвонке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПереводаЗвонка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипПереводаЗвонка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриниматьНесколькоВходящих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>RTPПорт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетекторАктивностиМикрофона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписокКодеков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстройствоВыводаЗвукаВходящегоЗвонка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияСофтфона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_Протоколы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>бит_Протоколы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>UDP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TCP</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/бит_БитфонСервер/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// Общий серверный модуль БИТ.Phone
// Содержит функции, не зависящие от конфигурации.
///////////////////////////////////////////////////////////////////////////////

Функция ПолучитьВерсиюВнешнейКомпоненты() ЭКСПОРТ
	Возврат "2.1.238";
КонецФункции

//-----------------------------------------------------------------------------
Функция ЗаписатьОшибкуВЖурналРегистрации(стрОшибка, стрОписание) ЭКСПОРТ
	бит_ТелефонияСервер.ЗаписатьОшибкуВЖурналРегистрации("БИТ.Phone", стрОшибка, стрОписание);
КонецФункции

// Возвращаемое значение - булево,
//   Истина если в регистре сведений есть настройки для текущего пользователя.
Функция ПроверитьНастройкиТекущегоПользователя() ЭКСПОРТ
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_БитфонНастройки.АдресСервера,
	               |	бит_БитфонНастройки.Логин,
	               |	бит_БитфонНастройки.Пароль
	               |ИЗ
	               |	РегистрСведений.бит_БитфонНастройки КАК бит_БитфонНастройки
	               |ГДЕ
	               |	бит_БитфонНастройки.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", бит_ТелефонияСервер.ПолучитьТекущегоПользователя());
	резт = Запрос.Выполнить();
	Если резт.Пустой() Тогда
		Возврат Ложь;
	КонецЕсли;
	табл = резт.Выгрузить();
	строкаРезт = табл[0];
	настроен = ЗначениеЗаполнено(строкаРезт.АдресСервера) И ЗначениеЗаполнено(строкаРезт.Логин);
	Возврат настроен;
КонецФункции

Процедура ПроверитьПрофильНастроек() ЭКСПОРТ
	профильНастр = ПолучитьПрофильНастроек();
	Если НЕ ЗначениеЗаполнено(профильНастр) Тогда
		УстановитьНастройку("ПрофильНастроек", Перечисления.бит_ПрофилиНастроекБИТPhone.БИТ_АТС);
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьRTPПортПоУмолчанию() ЭКСПОРТ
	Возврат 4000;
КонецФункции

Функция ПолучитьФлагАвтоопределениеNATПоУмолчанию() ЭКСПОРТ
	Возврат Истина;
КонецФункции

Процедура ЗаполнитьНастройкиПоУмолчаниюТекущегоПользователя(настройки) ЭКСПОРТ
	настройки.Пользователь					= бит_ТелефонияСервер.ПолучитьТекущегоПользователя();
	настройки.ПрофильНастроек				= Перечисления.бит_ПрофилиНастроекБИТPhone.БИТ_АТС;
	настройки.Протокол						= Перечисления.бит_Протоколы.UDP;
	настройки.ИнтервалПеререгистрации		= 300;
	настройки.АвтоопределениеNAT			= ПолучитьФлагАвтоопределениеNATПоУмолчанию();
	настройки.ФорматЗаписи					= Перечисления.бит_ФорматЗаписи.wav;
	настройки.КомандаПереадресации			= "#9";
	настройки.ГлубинаИсторииЗвонков			= 30;
	настройки.ПрефиксВыходаНаВнешнююЛинию	= бит_ТелефонияСервер.ПолучитьПрефиксВыходаНаВнешнююЛиниюПоУмолчанию();
	настройки.КомандаНеБеспокоить			= "#78";
	настройки.КомандаОтменаНеБеспокоить		= "#79";
	настройки.СерверЛицензийАдрес			= "127.0.0.1";
	настройки.СерверЛицензийПорт			= 10601;
	настройки.ОтправкаСМСОтправитель		= "SMS-TEST";
	настройки.УровеньЛоггирования			= 4;
	настройки.РазворачиватьОкноПриВходящемЗвонке = Истина;
	настройки.ТипПриемаЗвонка				= Перечисления.бит_ТипПриемаЗвонка.ПриниматьВручную;
	настройки.ТипПереводаЗвонка				= Перечисления.бит_ТипПереводаЗвонка.Условный;
	настройки.RTPПорт						= ПолучитьRTPПортПоУмолчанию();
КонецПроцедуры

Процедура УстановитьНастройку(стрНастройка, значениеНастройки)
	бит_ТелефонияСервер.УстановитьНастройкуТекущегоПользователя("бит_БитфонНастройки", "бит_БитфонСервер", стрНастройка, значениеНастройки);
КонецПроцедуры

Функция ДоступнаРольБитФонДляПользователя() ЭКСПОРТ
	Возврат (РольДоступна(Метаданные.Роли.бит_ПользовательБитфон) ИЛИ РольДоступна("ПолныеПрава"));
КонецФункции

Функция ПолучитьПараметрыСоединения() ЭКСПОРТ
	Пользователь = бит_ТелефонияСервер.ПолучитьТекущегоПользователя();
	СтруктураОтбора = Новый Структура("Пользователь", Пользователь);
	Возврат РегистрыСведений.бит_БитфонНастройки.Получить(СтруктураОтбора);
КонецФункции

Функция ПолучитьПрофильНастроек() ЭКСПОРТ
	профильНастр = ПолучитьПараметрыСоединения().ПрофильНастроек;
	Возврат профильНастр;
КонецФункции

Функция ПолучитьНомерФакса() ЭКСПОРТ
	номерФакса = ПолучитьПараметрыСоединения().НомерФакса;
	Возврат номерФакса;
КонецФункции

Функция ПолучитьДиректориюЗаписанныхФайлов() ЭКСПОРТ
	настрДиректория = ПолучитьПараметрыСоединения().ДиректорияЗаписанныхФайлов;
	Возврат настрДиректория;
КонецФункции

Функция ПолучитьФорматЗаписи() ЭКСПОРТ
	форматЗап = ПолучитьПараметрыСоединения().ФорматЗаписи;
	Возврат форматЗап;
КонецФункции

Функция ПолучитьКомандуПереадресации() ЭКСПОРТ
	команда = ПолучитьПараметрыСоединения().КомандаПереадресации;
	Возврат команда;
КонецФункции

Функция ПолучитьГлубинуИсторииЗвонков() ЭКСПОРТ
	глубина = ПолучитьПараметрыСоединения().ГлубинаИсторииЗвонков;
	Возврат глубина;
КонецФункции

Функция ПолучитьПрефиксВыходаНаВнешнююЛинию() ЭКСПОРТ
	префикс = ПолучитьПараметрыСоединения().ПрефиксВыходаНаВнешнююЛинию;
	Возврат префикс;
КонецФункции

Функция ПолучитьФлагИспользоватьПрямойНабор() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ИспользоватьПрямойНабор;
	Возврат флаг;
КонецФункции

Функция ПолучитьФлагИспользоватьКомандуНеБеспокоитьНаАТС() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ИспользоватьКомандуНеБеспокоитьНаАТС;
	Возврат флаг;
КонецФункции

Функция ПолучитьКомандуНеБеспокоить() ЭКСПОРТ
	команда = ПолучитьПараметрыСоединения().КомандаНеБеспокоить;
	Возврат команда;
КонецФункции

Функция ПолучитьКомандуОтменаНеБеспокоить() ЭКСПОРТ
	команда = ПолучитьПараметрыСоединения().КомандаОтменаНеБеспокоить;
	Возврат команда;
КонецФункции

Функция ПолучитьФлагРежимНеБеспокоить() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().РежимНеБеспокоить;
	Возврат флаг;
КонецФункции

Процедура УстановитьФлагРежимНеБеспокоить(включен) ЭКСПОРТ
	УстановитьНастройку("РежимНеБеспокоить", включен);
КонецПроцедуры

Функция ПолучитьАдресСервераЛицензий() ЭКСПОРТ
	адрес = ПолучитьПараметрыСоединения().СерверЛицензийАдрес;
	Возврат адрес;
КонецФункции

Функция ПолучитьПортСервераЛицензий() ЭКСПОРТ
	порт = ПолучитьПараметрыСоединения().СерверЛицензийПорт;
	Возврат порт;
КонецФункции

Функция ПолучитьФлагСервераЛицензийНеИспользоватьПрокси() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().СерверЛицензийНеИспользоватьПрокси;
	Возврат флаг;
КонецФункции

Функция ПолучитьУровеньЛоггирования() ЭКСПОРТ
	уровеньЛог = ПолучитьПараметрыСоединения().УровеньЛоггирования;
	Возврат уровеньЛог;
КонецФункции

Функция ПолучитьФлагСоздаватьСобытиеВходящийЗвонок() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().СоздаватьСобытиеПриВходящемЗвонке;
	Возврат флаг;
КонецФункции

Функция ПолучитьФлагСоздаватьСобытиеИсходящийЗвонок() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().СоздаватьСобытиеПриИсходящемЗвонке;
	Возврат флаг;
КонецФункции

Функция ПолучитьФлагСоздаватьСобытияПриВнутреннихЗвонках() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().СоздаватьСобытияПриВнутреннихЗвонках;
	Возврат флаг;
КонецФункции

Функция ПолучитьФлагВсегдаЗаписыватьРазговор() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ВсегдаЗаписыватьРазговор;
	Возврат флаг;
КонецФункции

Процедура ПолучитьПараметрыОтправкиСМС(стрСМСЛогин, стрСМСПароль) ЭКСПОРТ
	параметрыСоед = ПолучитьПараметрыСоединения();
	стрСМСЛогин = параметрыСоед.ОтправкаСМСЛогин;
	стрСМСПароль = параметрыСоед.ОтправкаСМСПароль;
КонецПроцедуры

Функция ПолучитьОтправителяСМСПоУмолчанию() ЭКСПОРТ
	отправитель = ПолучитьПараметрыСоединения().ОтправкаСМСОтправитель;
	Возврат отправитель;
КонецФункции

Функция ПолучитьСтационарныйТелефон() ЭКСПОРТ
	стрСтацТел = ПолучитьПараметрыСоединения().СтационарныйТелефон;
	Возврат стрСтацТел;
КонецФункции

Функция ПолучитьФлагИспользоватьСтационарныйТелефон() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ИспользоватьСтационарныйТелефон;
	Возврат флаг;
КонецФункции

Процедура УстановитьФлагИспользоватьСтационарныйТелефон(использовать) ЭКСПОРТ
	УстановитьНастройку("ИспользоватьСтационарныйТелефон", использовать);
КонецПроцедуры

Функция ПолучитьФлагАвтостартаПриЗапускеСистемы() ЭКСПОРТ
	Если НЕ бит_ТелефонияСерверПереопределяемый.ЕстьВозможностьАвтозапуска() Тогда
		Возврат Ложь;
	КонецЕсли;
	флаг = ПолучитьПараметрыСоединения().АвтозапускПриСтартеСистемы;
	Возврат флаг;
КонецФункции	

Функция ПолучитьСвойНомер() ЭКСПОРТ
	номер = ПолучитьПараметрыСоединения().СвойНомер;
	Возврат номер;
КонецФункции  

Функция ПолучитьФлагИнтеграцииСБИТАТС() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ИнтеграцияСБИТАТС;
	Возврат флаг;
КонецФункции  

Функция ПолучитьФлагРазворачиватьОкноПриВходящемЗвонке() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().РазворачиватьОкноПриВходящемЗвонке;
	Возврат флаг;
КонецФункции  

Функция ПолучитьФлагОткрыватьКартуЯндексПриВходящемЗвонке() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ОткрыватьКартуЯндексПриВходящемЗвонке;
	Возврат флаг;
КонецФункции  

Функция ПолучитьВерсиюВнешнейКомпонентыТекущегоПользователя() ЭКСПОРТ
	версия = ПолучитьПараметрыСоединения().ВерсияСофтфона;
	Возврат версия;
КонецФункции

Процедура УстановитьВерсиюВнешнейКомпонентыТекущегоПользователя(стрВерсия) ЭКСПОРТ
	УстановитьНастройку("ВерсияСофтфона", стрВерсия);
КонецПроцедуры

Функция ПолучитьФлагПолучениеСтатусовАбонентов() ЭКСПОРТ
	// + помощник перехода со старых релизов +
	Если ПолучитьПараметрыСоединения().УдалитьТипПодключенияСтатусов = Перечисления.бит_УдалитьТипПодключенияСтатуса.SIP Тогда
		УстановитьНастройку("ПолучениеСтатусов", Истина);
		УстановитьНастройку("УдалитьТипПодключенияСтатусов", Перечисления.бит_УдалитьТипПодключенияСтатуса.НеИспользовать);
	КонецЕсли;
	// -
	флаг = ПолучитьПараметрыСоединения().ПолучениеСтатусов;
	Возврат флаг;
КонецФункции  

Функция ПолучитьФлагНеИскатьКонтрагента() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().НеИскатьКонтрагента;
	Возврат флаг;
КонецФункции  

Функция ПолучитьФлагПриниматьНесколькоВходящих() ЭКСПОРТ
	флаг = ПолучитьПараметрыСоединения().ПриниматьНесколькоВходящих;
	Возврат флаг;
КонецФункции  

Функция ПолучитьТипПриемаЗвонка() ЭКСПОРТ
	тип = ПолучитьПараметрыСоединения().ТипПриемаЗвонка;
	Если НЕ ЗначениеЗаполнено(тип) Тогда
		тип = Перечисления.бит_ТипПриемаЗвонка.ПриниматьВручную;
		УстановитьНастройку("ТипПриемаЗвонка", тип);
	КонецЕсли;
	Возврат тип;
КонецФункции 

Функция ПолучитьТипПереводаЗвонка() ЭКСПОРТ
	тип = ПолучитьПараметрыСоединения().ТипПереводаЗвонка;
	Если НЕ ЗначениеЗаполнено(тип) Тогда
		тип = Перечисления.бит_ТипПереводаЗвонка.Условный;
		УстановитьНастройку("ТипПереводаЗвонка", тип);
	КонецЕсли;
	Возврат тип;
КонецФункции 

Функция ПолучитьСписокКодеков() ЭКСПОРТ
	список = ПолучитьПараметрыСоединения().СписокКодеков;
	Возврат список;
КонецФункции 

Процедура УстановитьСписокКодеков(стрСписок) ЭКСПОРТ
	УстановитьНастройку("СписокКодеков", стрСписок);
КонецПроцедуры

Функция ПолучитьУстройствоВыводаЗвукаВходящегоЗвонка() ЭКСПОРТ
	устройство = ПолучитьПараметрыСоединения().УстройствоВыводаЗвукаВходящегоЗвонка;
	Возврат устройство;
КонецФункции

//-----------------------------------------------------------------------------
// Создание событий

// Возвращает ссылку на новый созданный документ события взаимодействия
Функция СоздатьСобытие(флагВходящее, Контрагент, Номер, КонтактноеЛицо, стрЗаписьРазговора) ЭКСПОРТ
	длинаНомера = СтрДлина(Номер);
	длинаВнешнегоНомера = бит_ТелефонияКлиентСервер.ПолучитьДлинуВнешнегоНомера();
	создаватьСобытияПриВнутреннихЗвонках = бит_БитфонСервер.ПолучитьФлагСоздаватьСобытияПриВнутреннихЗвонках();
	Если НЕ создаватьСобытияПриВнутреннихЗвонках И длинаНомера < длинаВнешнегоНомера Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		// Контрагент не был найден - номер уже изменился, ожидается событие изменения номера и создание события в нем.
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат бит_ТелефонияСерверПереопределяемый.СоздатьСобытиеЗвонка(флагВходящее, Контрагент, Номер, КонтактноеЛицо, стрЗаписьРазговора);
КонецФункции

//-----------------------------------------------------------------------------
// Поиск контрагента и контактного лица по номеру телефона.
//
// Параметры:
//  НомерДляПоиска - Строка - номер телефона.
//  КонтрагентСсылка - ссылка на элемент справочника контрагентов (возвращаемый параметр).
//  КонтактноеЛицоСсылка - ссылка на элемент справочника контактных лиц (возвращаемый параметр).
//  флагНеИскатьКонтрагента - Булево - флаг, отключающий поиск в базе данных,
//                            параметры контрагент и контактное лицо заполняются пустыми ссылками.
//
// Возвращаемое значение:
//   Булево - признак успешности поиска контрагента по номеру.
//
Функция НайтиКонтрагентаИКонтактноеЛицоПоНомеру(НомерДляПоиска, КонтрагентСсылка, КонтактноеЛицоСсылка, флагНеИскатьКонтрагента) ЭКСПОРТ
	КороткийНомер = бит_ТелефонияКлиентСервер.СократитьНомерДляПоиска(НомерДляПоиска);
	Если НЕ ЗначениеЗаполнено(КороткийНомер) ИЛИ флагНеИскатьКонтрагента Тогда
		стрИмяСправочникаКонтрагентов = бит_ТелефонияСерверПереопределяемый.ПолучитьИмяСправочникаКонтрагентов();
		стрИмяСправочникаКонтактныхЛиц = бит_ТелефонияСерверПереопределяемый.ПолучитьИмяСправочникаКонтактныхЛиц();
		КонтрагентСсылка = Справочники[стрИмяСправочникаКонтрагентов].ПустаяСсылка();
		КонтактноеЛицоСсылка = Справочники[стрИмяСправочникаКонтактныхЛиц].ПустаяСсылка();
		Возврат Ложь;
	КонецЕсли;
	Возврат бит_ТелефонияСерверПереопределяемый.НайтиКонтрагентаПоНомеруВКонтактах(КороткийНомер, КонтрагентСсылка, КонтактноеЛицоСсылка);
КонецФункции

//-----------------------------------------------------------------------------
Функция ПолучитьНомерДляОператора(стрНомер, контрагент, контактноеЛицо) ЭКСПОРТ
	стрНомер = "";
	
	структОтбор = Новый Структура("Пользователь", бит_ТелефонияСервер.ПолучитьТекущегоПользователя());
	выборка = РегистрыСведений.бит_СпискиОбзвона.Выбрать(структОтбор);
	Если НЕ выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СписокОбзвонаТекущий = выборка.Список;
	Если НЕ ЗначениеЗаполнено(СписокОбзвонаТекущий) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	бит_СписокОбзвонаСписок.Ссылка КАК Ссылка,
	               |	бит_СписокОбзвонаСписок.НомерСтроки КАК НомерСтроки,
	               |	бит_СписокОбзвонаСписок.НомерТелефона КАК НомерТелефона,
	               |	бит_СписокОбзвонаСписок.Контрагент КАК Контрагент,
	               |	бит_СписокОбзвонаСписок.КонтактноеЛицо КАК КонтактноеЛицо,
	               |	бит_СписокОбзвонаСписок.Обработан КАК Обработан,
	               |	бит_СписокОбзвонаСписок.ВидТелефона КАК ВидТелефона
	               |ИЗ
	               |	Документ.бит_СписокОбзвона.Список КАК бит_СписокОбзвонаСписок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_СписокОбзвона КАК бит_СписокОбзвона
	               |		ПО бит_СписокОбзвонаСписок.Ссылка = бит_СписокОбзвона.Ссылка
	               |ГДЕ
	               |	бит_СписокОбзвона.Ссылка = &Ссылка
	               |	И бит_СписокОбзвонаСписок.Обработан = ЛОЖЬ";
	
		
	Запрос.УстановитьПараметр("Ссылка", СписокОбзвонаТекущий);
	выгрузка = Запрос.Выполнить().Выбрать();
	Если выгрузка.Количество() = 0 Тогда
		ОтменитьТранзакцию();
		Возврат Истина;
	КонецЕсли;
	
	выгрузка.Следующий();
	
	стрНомер			= выгрузка.НомерТелефона;
	контрагент			= выгрузка.Контрагент;
	контактноеЛицо		= выгрузка.КонтактноеЛицо;
	
	
	списокОбзвона = выгрузка.Ссылка;
	списокОбзвонаОб = списокОбзвона.ПолучитьОбъект();
	строка = списокОбзвонаОб.Список.Найти(выгрузка.НомерСтроки, "НомерСтроки");
	Если строка <> Неопределено Тогда
		строка.Обработан = Истина;
	КонецЕсли;
	списокОбзвонаОб.Записать();
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
КонецФункции

//-----------------------------------------------------------------------------
// Возвращаемое значение - структура, в которой поле Ключ указывает на запись настроек текущего пользователя.
Функция ПолучитьПараметрыОткрытияФормыНастроек() ЭКСПОРТ
	Возврат бит_ТелефонияСервер.ПолучитьПараметрыОткрытияФормыНастроек("бит_БитфонНастройки", "бит_БитфонСервер");
КонецФункции

//-----------------------------------------------------------------------------
Функция ОтправитьПочтовоеСообщениеВТехподдержку(стрТема, стрТекст, стрНаименованиеВложения, двоичнВложение, сообщение) ЭКСПОРТ
	Письмо = Новый ИнтернетПочтовоеСообщение;
	
	Письмо.Тема = стрТема;
	Текст = Письмо.Тексты.Добавить(стрТекст, ТипТекстаПочтовогоСообщения.ПростойТекст);
	Письмо.Отправитель = "BIT.Phonesupport@1cbit.ru";
	Письмо.ИмяОтправителя = "БИТ.Phone техническая поддержка";
	
	Письмо.Вложения.Добавить(двоичнВложение, стрНаименованиеВложения);
	
	Письмо.Получатели.Добавить("bitphone@1cbit.ru");
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	Профиль.АдресСервераSMTP = "mx.1cbit.ru";
	Профиль.ПортSMTP = 587;
	Профиль.ПользовательSMTP = "BIT.Phonesupport@1cbit.ru";
	Профиль.ПарольSMTP = "NYF7ayjyu";
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	
	Почта = Новый ИнтернетПочта;
	
	успешностьОтправки = Истина;
	 
	Попытка
		Почта.Подключиться(Профиль);
		сообщение.Текст = сообщение.Текст + Символы.ПС + "Подключение к почтовому серверу БИТ успешно установлено";
		
		Почта.Послать(Письмо);
		сообщение.Текст = сообщение.Текст + Символы.ПС + "Письмо отправлено";
		
		Почта.Отключиться();
	Исключение
		успешностьОтправки = Ложь;
		сообщение.Текст = сообщение.Текст + Символы.ПС + "Не удалось подключиться к почтовому серверу БИТ - " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат успешностьОтправки;
КонецФункции
